{"data":{"markdownRemark":{"html":"<h3>How to add new people to Github</h3>\n<ol>\n<li>Send an email to Bob Henrikson (robert.henrikson@va.gov) (also @bobrox1973 on Github)</li>\n<li>Include new person email address or Github user handle </li>\n<li>Include what team they are being added. Please see example below:  </li>\n<li><code>The following individual [insert email or Github username] needs be added to this team [insert team. e.g., Ad Hoc-general]</code> </li>\n<li>Please expect your request/issue to be closed within 24hrs.  </li>\n</ol>\n<p><em>Note: New person needs to set-up Two-Factor authentication (2FA). This is enforced by Github. If someone doesn't set up 2FA, they risk be removed from the organization.</em></p>\n<h3>How to request adding new repositories</h3>\n<ol>\n<li>Send an email to Bob Henrikson (robert.henrikson@va.gov) (also @bobrox1973 on Github)</li>\n<li>Include the following details in your email:</li>\n<li>What is the purpose/need of this repo?</li>\n<li>What is the repo name? <em>lowercase, no spaces ie. lowercase-no-spaces</em></li>\n<li>Is it a public or private? (see below for repo best practices)</li>\n<li>What teams should be added to this repo? </li>\n<li>What are the permission settings for each team (read, write)?</li>\n<li>What is your personal GitHub user handle?</li>\n</ol>\n<p><strong>Best practices for repo:</strong></p>\n<ul>\n<li>\n<p>Public:</p>\n<ul>\n<li>This should be the default option for repositories in the Department of Veterans Affairs Github organization.</li>\n<li>These repositories should have an appropriate open source license associated with them, but this is not up to the Github administrators to enforce / require it is just a best practice.</li>\n</ul>\n</li>\n<li>\n<p>Private:</p>\n<ul>\n<li>This should be used for code that not able to be released and made open source.</li>\n<li>This can be used for a documentation repository.</li>\n<li>This can be used for a planning / issue tracking purposes.</li>\n</ul>\n</li>\n<li>\n<p>Things that should not be checked into version control no matter if they are public or private</p>\n<ul>\n<li>User credentials</li>\n<li>Private keys</li>\n<li>Production resource details (database IP addresses and connection strings,…)</li>\n</ul>\n</li>\n<li>As a default, DSVA GH team should be set as \"admin\" for all new repos. </li>\n</ul>","fields":{"slug":"Work Practices/Github Requests"}}},"pageContext":{"id":"c2bb5eff-e782-503a-bc7b-2a9a98fcbb6c","name":"Work Practices/Github Requests"}}