{"data":{"markdownRemark":{"html":"<h1>How to File Bugs, Tasks, and Questions</h1>\n<p>This document describes how to log bugs, tasks (such as new features and/or things people need to work on), and project-based questions (ones that are not quickly answered in Slack and have impact on a project).</p>\n<h2>What is GitHub [Issues]?</h2>\n<p>First off, GitHub is a system that stores documents and keeps a revision history of those files. This is great for code and/or documents that you can share with the team. Aside from storage, <strong>it provides the infrastructure to track work items such as new tasks, product goals, bugs, and project questions.</strong> This part of GitHub is called <a href=\"https://guides.github.com/features/issues/\"><strong>Issues</strong></a>.</p>\n<p>GitHub is divided into repositories (i.e. a project or group of files it stores) and has an Issue bucket that is associated with each repository.</p>\n<p>Issues contain several fields:</p>\n<ul>\n<li><strong>Title</strong>: One line description of the Issue</li>\n<li><strong>Comment</strong>: A more verbose description of the Issue</li>\n<li><strong>Milestones</strong>: A sprint in which the Issue is set to be completed</li>\n<li><strong>Epics</strong>: A product goal that the Issue is associated with *(Zenhub feature)</li>\n<li><strong>Label</strong>: A tag that describes the type of Issue (examples: <code>backend</code>,<code>question</code> or <code>bug</code>)</li>\n<li><strong>Assignee</strong>: The person that has outstanding work to complete on an Issue</li>\n</ul>\n<h2>What is Zenhub?</h2>\n<p>Zenhub is a snazzy user interface for managing workflow of GitHub Issues via an <a href=\"https://en.wikipedia.org/wiki/Scrum_(software_development)\">Agile board</a>.</p>\n<p>Zenhub provides pieces of key functionality that do not exist in GitHub Issues by itself:</p>\n<h3>Zenhub Pipelines</h3>\n<p><strong>Pipelines</strong> - are scrum board columns that indicate an Issue's state. Pipelines that we use include:</p>\n<ul>\n<li><strong>Backlog</strong>: Issues that have not been <a href=\"https://www.mountaingoatsoftware.com/blog/product-backlog-refinement-grooming\">groomed</a></li>\n<li>\n<p><strong>Ice Box</strong>: This is the \"we'll get around to it\" pipeline, where issues go when they've been groomed but aren't ready to be worked on yet</p>\n<ul>\n<li>This may be because they're not a high enough priority (e.g. fiddly bug fixes) or they don't have sufficient information</li>\n</ul>\n</li>\n<li><strong>Epics</strong>: This pipeline hosts <a href=\"https://www.zenhub.com/guides/agile-concepts-in-github#github-issues-as-epics\">Epic Issues</a> which are product goals that consist of multiple smaller Issues</li>\n<li><strong>Ready</strong>: Issues here are ordered by priority (see below) and have enough detail that they can be pulled from at any time</li>\n<li><strong>Current Sprint</strong>: The team has committed to working on the Issues during their present work sprint (1-2 weeks)</li>\n<li><strong>In Progress</strong>: Issues that are actively being worked on</li>\n<li><strong>Validate</strong> (code repositories only): Issues that have PRs ready for review</li>\n<li><strong>Done</strong>: Issues that have been completed and their PRs merged into <code>master</code></li>\n</ul>\n<h3>Priority</h3>\n<p>Issues live vertically within work pipelines. Zenhub lets you drag Issues above or below each other. An Issue's vertical position within a pipeline indicates its priority; with the highest priority issues at the top.</p>\n<h2>New Repo Setup</h2>\n<p>New GitHub repositories need to be added to the Zenhub board via the 'Repos' dropdown in the top left of the Zenhub board. </p>\n<p><strong>Important: Be careful not to unlink repos within the 'Repos' dropdown.</strong> This will effect the entire team and mess up the board.</p>\n<h3>Labels</h3>\n<p>Labels are used to organzie work by:</p>\n<ul>\n<li><strong>Team</strong> (Rainbows, Kudos, Unicorns, Nebula, Platform)</li>\n<li><strong>Focus</strong> (Frontend, Backend, UX, Content, etc.)</li>\n<li><strong>Product</strong> (HCA, Identity, Sitewide, etc.)</li>\n<li><strong>Type</strong> (Bug, Testing, Discovery, etc)</li>\n</ul>\n<h3>Zenhub Board</h3>\n<p>To link Zenhub to your GitHub repository and Issues:</p>\n<ol>\n<li>Go to <a href=\"https://zenhub.com/\">Zenhub.com</a>, sign in with Github, and authorize access to private repositories (you'll have to agree to several prompts)</li>\n<li>View your Zenhub agile board here --> <a href=\"https://app.zenhub.com/workspace/o/department-of-veterans-affairs/vets.gov-team\">https://app.zenhub.com/workspace/o/department-of-veterans-affairs/vets.gov-team</a> </li>\n<li>To enable ZenHub features on GitHub, download the <a href=\"https://www.zenhub.com/extension\">Zenhub Browser Extension</a></li>\n</ol>\n<h2>When to File Issues</h2>\n<p>The most common situations to file issues are:</p>\n<ul>\n<li><strong>New Features</strong>: Something new needs to be made or figured out</li>\n<li><strong>Bugs</strong>: Something is broken on a code project or with a team process</li>\n<li><strong>Question</strong>: Questions about the project that either will take some time to answer or it's important to document the answer to</li>\n</ul>\n<h2>Tips</h2>\n<h3>New Features: What to Include</h3>\n<ul>\n<li>Concise title to summarize the new feature</li>\n<li>\n<p>The description should include:</p>\n<ul>\n<li>What the new feature is</li>\n<li>Why it's being done (if not obvious)</li>\n<li>Sub-tasks that might need to be done to complete it</li>\n<li>Any design images or documents that would support completing it</li>\n</ul>\n</li>\n<li>Label with what kind of team members are needed to complete it (example: developer, designer, etc.)</li>\n</ul>\n<h3>Bugs: What to Include</h3>\n<ul>\n<li>Concise title to summarize the problem</li>\n<li>\n<p>The description should include:</p>\n<ul>\n<li>Extremely granular steps to recreate it</li>\n<li>Expected outcome</li>\n<li>Actual outcome</li>\n<li>Screenshots or screen recordings</li>\n<li>Environment that it occurred in (what username, browser, date/time, etc.)</li>\n</ul>\n</li>\n<li>Assign to someone capable of resolving it, or a team lead</li>\n</ul>\n<h3>Questions: What to Include</h3>\n<ul>\n<li>One sentence version of question as title</li>\n<li>Description should include the context of the question, but also things you've already done to investigate finding an answer</li>\n<li>Assign to someone capable of resolving it, or a team lead</li>\n</ul>","fields":{"slug":"Work Practices/How to File Bugs Tasks and Questions"}}},"pageContext":{"id":"3488a73d-6367-5b6f-bb92-f3f361c2a469","name":"Work Practices/How to File Bugs Tasks and Questions"}}