{"data":{"markdownRemark":{"html":"<h1>Instructions for how to access Vets.gov in Staging:</h1>\n<p>Go to <a href=\"https://staging.vets.gov/\">https://staging.vets.gov/</a>. If you are prompted for a username and password to access this page, enter:</p>\n<ul>\n<li>Username: veterans</li>\n<li>Password: am3rica</li>\n</ul>\n<h1>Login steps</h1>\n<ul>\n<li>From any page, in the top right corner click \"Sign In\".  </li>\n<li>Select ID.me to sign in, and enter the username and the password desired and click Sign in. The username will be of the format \"vets.gov.user+XXX@gmail.com\" (where XXX will change depending on the product) and the password will always be \"Zm9ydHkgdHdv\" in staging. </li>\n<li>\n<p>You will then be prompted to \"enable 2FA\". </p>\n<ul>\n<li>Click \"Phone\"</li>\n<li>On the next screen you'll see a phone number, don't worry that you don't have access to that phone number, on staging, you don't actually have to enter this code. </li>\n<li>Click Continue</li>\n<li>On the next screen you will see the code already entered. Click Continue again. </li>\n</ul>\n</li>\n<li>The popup should now close and you're logged in. </li>\n</ul>\n<p>A full list of staging test users is in <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Products/Identity/MVI%20Integration/reference_documents/mvi_users_s1a.csv\">mvi<em>users</em>s1a.csv</a>, but not all test users exist in all VA backend test environments, so see below for which users to log in with for specific vets.gov features.</p>\n<h1>Distribution</h1>\n<p>These credentials are considered \"sensitive\" but not \"classified\" by the team, and can be provided to small sets of trusted external users on a need to know basis. There is no guarantee of availability or accuracy. If significant load will be generated, or testing goes beyond confirming basic functionality, please reach out to the #vetsgov-engineers channel to work through options.</p>\n<h1>Content</h1>\n<p>You do not need to log in to read any of our content besides what is specifically on the pages in the tools below.  Read away and especially check out the various ways to navigate the content!</p>\n<h1>Forms</h1>\n<p>You do not <em>need</em> to log in use most forms. But if you do, your progress will be saved along the way. Signing in will also prefill forms with data we can pull from the account profile. 526 (Disability Comp) <strong>requires</strong> sign-in because it needs to pull PII and PHI from VA sources to be successfully submitted. </p>\n<h1>Health Tools</h1>\n<p>To test Prescription Refills, Secure Messaging, and Blue Button, log in as user vets.gov.user+264@gmail.com. </p>\n<ul>\n<li>Access Prescriptions at: <a href=\"https://staging.vets.gov/health-care/prescriptions\">https://staging.vets.gov/health-care/prescriptions</a> (please don't actually click to confirm any refills, as we only have a limited number of those and have to request more from MHV every time we run out). </li>\n<li>Access Secure Messaging at: <a href=\"https://staging.vets.gov/health-care/messaging\">https://staging.vets.gov/health-care/messaging</a></li>\n<li>Access Blue Button at: <a href=\"https://staging.vets.gov/health-care/health-records\">https://staging.vets.gov/health-care/health-records</a> (Note, in staging because of the data setup we have, it will never automatically move off the \"updating your records\" page and you'll need to manually click \"get an older version of your records\" to get to the next page). </li>\n</ul>\n<h1>Claims and Appeals Status</h1>\n<p>Claims and appeals status are together in one product. To view this, log in as user vets.gov.user+226@gmail.com and visit <a href=\"https://staging.vets.gov/track-claims\">https://staging.vets.gov/track-claims</a>. </p>\n<p>Additionally, users 300 - 314 all have appeals in various statuses, so feel free to log in as any of those users to see what appeals in other statuses look like (but those users don't have any claims). </p>\n<h1>Post 9/11 GI Bill Status and VA Letters</h1>\n<p>To view these two products, you can log in as user vets.gov.user+299@gmail.com. </p>\n<ul>\n<li>Access Post 9/11 GI Bill Status: <a href=\"https://staging.vets.gov/education/gi-bill/post-9-11/ch-33-benefit\">https://staging.vets.gov/education/gi-bill/post-9-11/ch-33-benefit</a></li>\n<li>Access VA Letters at: <a href=\"https://staging.vets.gov/letters\">https://staging.vets.gov/letters</a></li>\n</ul>\n<p>As more products are added, please add them here. </p>","fields":{"slug":"Work Practices/Accessing-Staging"}}},"pageContext":{"id":"dd97dd3b-59da-5feb-8b2e-e4e3ffc4f5f5","name":"Work Practices/Accessing-Staging"}}