{"data":{"markdownRemark":{"html":"<h1>Accessibility and 508 Best Practices and Launch Guidelines</h1>\n<p>This document</p>\n<ol>\n<li>Describes the accessibility and 508 launch criteria for all vets.gov launches</li>\n<li>Provides best practices for our own manual QA and for working with the Section 508 office to evaluate vets.gov products</li>\n</ol>\n<p><em>TODO(@rroueche): link to this document from [vets.gov launch checklist](<a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/Product%20Management/Product\">https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/Product%20Management/Product</a></em>Launch<em>Guide.md) and future vets.gov QA testing doc</em></p>\n<h2>Launch Criteria</h2>\n<ol>\n<li>Automated build e2e tests must excercise all functionality in the launched product</li>\n<li><strong>Each rendered page must pass an aXe check</strong> (<a href=\"https://github.com/department-of-veterans-affairs/vets-website/blob/master/test/accessibility/sample.spec.js\">example</a>). The default aXe rule sets (<code>section-508</code>, <code>wcag2a</code>, <code>wcag2aa</code>) should be used in all tests, except in the case of false positives. In those cases, rules may be selectively disabled (see <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/issues/8810\">#8110</a> for work-in-progress on how to best disable rules). </li>\n<li>\n<p><strong>Zoom Test</strong></p>\n<ul>\n<li>Set browser width to 1280px</li>\n<li>Zoom using Ctrl and + or Cmd and + on Mac, until browser says 400%</li>\n<li>Layouts should not scroll sideways or have content to the edges</li>\n<li><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/reflow.html\">WCAG: Understanding Reflow</a></li>\n</ul>\n</li>\n<li>\n<p><strong>Keyboard Navigation</strong></p>\n<ul>\n<li>All natively focusable elements (links, form inputs, buttons, radios, checkboxes) reachable by keyboard</li>\n<li>No keyboard traps</li>\n<li>Predictable tabbing order</li>\n<li>Ways to skip large groups of links (skip to content link)</li>\n<li><a href=\"https://webaim.org/techniques/keyboard/\">WebAIM keyboard accessibility guide</a></li>\n</ul>\n</li>\n<li>\n<p><strong>User Flow</strong>\nThe flow must be possible to complete on <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/Engineering/DocumentedDecisions/Browser%20Support.md\">vets.gov supported browsers</a> with the most commonly used screenreader(s) (see for example <a href=\"https://webaim.org/projects/screenreadersurvey7/\">2017 WebAIM screenreader survey</a>):</p>\n<ul>\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled> Safari: Voice Over</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled> IE11: JAWS (tested by the Section 508 office)</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled> Chrome: JAWS (tested by the Section 508 office, second option upon request)</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled> Firefox: NVDA (tested by the Section 508 office, third option upon request)</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled> User flow must be possible using a keyboard only (no pointing device). See the <a href=\"https://webaim.org/techniques/keyboard/\">WebAIM keyboard accessibility guide</a> for keyboard strokes.</li>\n<li>zoom browser to 400% and verify that the layout is still meaningful and the feature is still usable (see WCAG guide for <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/reflow.html\">understanding reflow</a>)</li>\n</ul>\n</li>\n</ol>\n<p>The following additional tests are optional but may be considered:</p>\n<ol>\n<li>test all flows with Firefox: NVDA</li>\n<li>test for color blindness accessibility with tools like the <a href=\"https://chrome.google.com/webstore/detail/colorblinding/dgbgleaofjainknadoffbjkclicbbgaa?hl=en\">Chrome Colorblinding plugin</a></li>\n<li>for designers, there is a Sketch plugin, <a href=\"https://github.com/getflourish/Sketch-Color-Contrast-Analyser\">Color Contrast Analyser</a> to catch contrast issues early</li>\n</ol>\n<h2>Section 508 Office</h2>\n<p>vets.gov has a monthly phone call with the Section 508 office to discuss any products and accessibility issues that the 508 office has surfaced. At or after each meeting, we send them a new set of products to evaluate. Some of these products may already be live and are just in a backlog for a11y/508 testing, but in general we should ask the 508 office to review products in staging <em>before</em> we launch.  </p>\n<p>This <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/Accessibility%20and%20508/508officeReviewList.md\">tracking doc</a> shows which products have been evaluated or are being evaluated, including tickets for addressing each issue reported.</p>\n<p>The 508 Office likes to send the issues they find as a Word doc. Sometimes the issue they report is difficult for us to reproduce, or is ambiguous--in those cases it is the responsibility of the sprint team to contact the 508 office via email or phone call (contact info below) to clarify the issue. This can be a product manager, a designer, or an engineer. It is not OK to simply comment in the issue that it was not reproducible without following up with the 508 office to fully understand the problem.</p>\n<p>Once the issue is understood, it should be converted to a github ticket, labeled with the product or feature that pertains to it, and assigned to the vets.gov sprint team who owns that product. Please see below section on <a href=\"#documenting-issues-found-via-manual-qa\">Documenting issues found via manual QA</a>.</p>\n<p>Section 508 Office Contact Innformation:</p>\n<ul>\n<li>Linsey DeLisle: linsey.delisle@va.gov</li>\n<li>Jose Beltran: Jose.Beltran3@va.gov</li>\n</ul>\n<p>Current vets.gov attendees:</p>\n<ul>\n<li>@lalexanderson-dsva</li>\n<li>@1Copenut (beginning March 2018)</li>\n</ul>\n<h2>Documenting issues found via manual QA</h2>\n<p>Creating actionable a11y/508 tickets is a bit of an art. If the issue is reported by the Section 508 issue, it is likely in a Word doc, and may lump together several different issues found in different products or in our headers/nav/footers. These steps might help you get started until you come up with your own system:</p>\n<ol>\n<li>Try to reproduce the issue using Safari and Voice Over (use <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/Accessibility%20and%20508/Mac_VoiceOver_guide.md\">this guide</a> to get started)</li>\n<li>If you cannot reproduce the issue, email the 508 office contacts above to have them explain what they did to encounter the issue. You may even want to set up a meeting and screenshare to see them reproduce it.</li>\n<li>If you can reproduct the issue, you may consider doing a screen capture to illustrate any unexpected behavior, uploading it to YouTube (unlisted), and including the link in the github ticket you create. @BBarone1 and @rtluu are masters at this, so reach out to them for advice.</li>\n<li>Label the ticket with the appropriate product label and sprint team label. if the problem is in a header/nav/footer or other shared asset, label it <code>sitewide</code></li>\n<li>Assign the ticket to the sprint team's product manager, or to @rroueche if they are <code>sitewide</code></li>\n<li>\n<p>Decide if the issue is launch-blocking and explain your reasoning in the ticket</p>\n<ul>\n<li>if the feature is not usable on one of the listed screenreaders or with keyboard interaction, meaning the user cannot interact with it and get through the flow, then it must be fixed before launch</li>\n<li>if the feature is hard to use or not ideally built but still usable with the listed screenreaders or with keyboard interaction, then it may be OK to launch, but the issue should be fixed in the following sprint</li>\n<li>all other accessibility/508 issues should be fixed within the next program increment</li>\n<li><em>there should not be open, unfixed a11y and 508 issues that linger for more than 3 sprints!</em></li>\n</ul>\n</li>\n</ol>\n<h3>DSVA 508 Agreeement</h3>\n<p>This 2016 <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Memos/508-DS-Process.md\">508 memo</a> outlines an agreement between DSVA and the Section 508 office on the process for ensuring 508 compliance for DSVA-led products. This process likely differs from other VA IT projects because we launch new products and deploy far more frequently than is typical. Key things from the memo:</p>\n<ul>\n<li>requires us to integrate our testing with a <a href=\"https://www.deque.com\">Deque</a> product, either <a href=\"https://www.deque.com/products/worldspace-attest/\">Attest</a> or <a href=\"https://axe-core.org/docs/\">aXe</a>. As of Feb 2018, we have been using the <a href=\"https://github.com/dequelabs/axe-core\">axe-core library</a> in all of our end-to-end tests.</li>\n<li>All code must pass those tests before deploying to production, which we have been practicing</li>\n<li>The following aXe rule sets must be applied in our tests: <code>section-508</code>, <code>wcag2a</code>, <code>wcag2aa</code> which aim for both Section 508 compliance and to comply with the WCAG 2.0 Level AA standard. </li>\n<li>Our automated tests are what permit us to not require 508 office evaluations to gate our launches. \"This validation is in lieu of the current sign-off process because Digital Service is integrating automated scans and correction process into the continuous delivery deployment model.\" We thank our predecessors for this.</li>\n<li><em>Periodic manual accessibility testing is required</em> to catch any issues not found by automated testing. This should be done both by the vets.gov team and by the 508 office, as describe above in the <a href=\"#launch-criteria\">Launch Criteria</a> section.</li>\n<li>Issues or false positives surfaced by manual testing (our own testing as well as that done by the 508 office) must be 1) documented, 2) categorized by severity. For \"interim deployments\" (read, minor updates), high severity defects must be fixed. For \"final deployments\" (read, major launches), all known defects (low, medium, high severity) must be fixed.</li>\n</ul>","fields":{"slug":"Work Practices/Accessibility and 508/a11y-508-launch-guidelines"}}},"pageContext":{"id":"64d514df-ec86-5ec3-b072-a094e72abb2f","name":"Work Practices/Accessibility and 508/a11y-508-launch-guidelines"}}