{"data":{"markdownRemark":{"html":"<h1>Zenhub basics</h1>\n<p>Make sure you can see the vets.gov <a href=\"https://app.zenhub.com/workspace/o/department-of-veterans-affairs/vets.gov-team/boards\">Zenhub board</a>.  This is how we do sprint planning, with filtering by label.\n- You can also download the <a href=\"https://www.zenhub.com/extension\">Zenhub Browser Extension</a> for Chrome or Mozilla.</p>\n<p>Zenhub has a lot going on, and the first time going in to look at workflow can be disconcerting, at best. This quick guide to workflow should help. The workflow page contains much more information about products, who’s in charge of teams and where you can find more information about the teams. You’ll get an invitation to join.</p>\n<p><a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/Onboarding%20and%20Offboarding/zenhub_onboarding.pdf\">After you get the invitation, visit this awesome page Ryan created to learn how to use Zenhub</a>.</p>\n<p><a href=\"https://app.zenhub.com/workspace/o/department-of-veterans-affairs/vets.gov-team/boards?notFullScreen=false&#x26;repos=31788863\">Visit our Zenhub site</a>.</p>\n<p>Things you’ll need to know right off the bat: </p>\n<p>At the top of the Zenhub page, you can search under “assignees” to find yourself. This is the work you’ve been assigned. Ad Hoc has also created a page the shows how our team uses Zenhub.</p>\n<p><a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/Product%20Management/zenhub_product_management.pdf\">Take a look at how Vets.gov uses Zenhub</a>.</p>\n<p>Issues within Github contain several fields:</p>\n<ul>\n<li><strong>Title</strong>: One-line description of the Issue</li>\n<li><strong>Comment</strong>: A more verbose description of the Issue</li>\n<li><strong>Milestones</strong>: A sprint in which the Issue is set to be completed</li>\n<li><strong>Epics</strong>: A product goal that the Issue is associated with (Zenhub feature)</li>\n<li><strong>Label</strong>: A tag that describes the type of Issue (examples: backend,question or bug)</li>\n<li><strong>Team</strong> (Rainbows, Kudos, Unicorns, Nebula, Platform)</li>\n<li><strong>Focus</strong> (Frontend, Backend, UX, Content, etc.)</li>\n<li><strong>Product</strong> (HCA, Identity, Sitewide, etc.)</li>\n<li><strong>Type</strong> (Bug, Testing, Discovery, etc)</li>\n<li><strong>Assignee</strong>: The person that has outstanding work to complete on an Issue</li>\n<li><strong>Pipelines</strong>: are scrum board columns that indicate an Issue's state. Pipelines that we use include:</li>\n<li><strong>Backlog</strong>: Issues that have not been groomed</li>\n<li><strong>Ice Box</strong>: This is the \"we'll get around to it\" pipeline, where issues go when they've been groomed but aren't ready to be worked on yet. This may be because they're not a high enough priority (e.g. fiddly bug fixes) or they don't have sufficient information</li>\n<li><strong>Epics</strong>: This pipeline hosts Epic Issues which are product goals that consist of multiple smaller Issues</li>\n<li><strong>Ready</strong>: Issues here are ordered by priority (see below) and have enough detail that they can be pulled from at any time</li>\n<li><strong>Current Sprint</strong>: The team has committed to working on the Issues during their present work sprint (1-2 weeks)</li>\n<li><strong>In Progress</strong>: Issues that are actively being worked on</li>\n<li><strong>Validate</strong> (code repositories only): Issues that have PRs ready for review</li>\n<li><strong>Done</strong>: Issues that have been completed and their PRs merged into master For more information on workflow, labels, and Zenhub visit <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/How%20to%20File%20Bugs%20Tasks%20and%20Questions.md\">How to File Bugs, Tasks, and Questions</a>.</li>\n</ul>\n<p><strong>Labeling</strong>\nEach Issue (a.k.a. work item) is labeled, minimally, with the name of the team it belongs to and the product. This helps product teams discover, triage, and track work.</p>","fields":{"slug":"Work Practices/zenhub description"}}},"pageContext":{"id":"d278bd17-5d03-57ac-8976-7d83092deb88","name":"Work Practices/zenhub description"}}