{"data":{"markdownRemark":{"html":"<h1>Using GitHub and Contributing Code</h1>\n<p>All code and related documentation written by the DSVA team needs to be stored in a place that shows revision history and the ability to share code across developers. Additionally, it should be light-weight enough that developers don't spend the bulk of their time doing merges or extended syncing with the system.</p>\n<h2>GitHub</h2>\n<p>The team chose GitHub as its version control system. The reasons why include:</p>\n<ul>\n<li>Stores revision history of files</li>\n<li>Quickly synchronizes and merges changes between branches of development</li>\n<li>Built-in code review mechanisms (Pull Requests)</li>\n<li>Very common amongst developers (easy to hire folks that know it)</li>\n<li>Provides mechanisms for access control</li>\n<li>Integrates with other tools (Travis CI, Slack)</li>\n<li>Makes it easy to share code with the open source community</li>\n<li>Distributed (all people with a copy of a repository have a backup, easy to recover)</li>\n<li>Highly available</li>\n<li>Cheap (at $9 a user a month, still more affordable than internally hosted solutions and other commercial options)</li>\n</ul>\n<p>For more about how we manage tasks, bugs, and questions via GitHub Issues and Zenhub, <a href=\"How%20to%20File%20Bugs%20Tasks%20and%20Questions.md\">see this document</a>.</p>\n<h2>Branches</h2>\n<p>The following branches exist within code-based GitHub repositories:</p>\n<ul>\n<li><strong>master</strong>: Stable and functioning code that is deployed to the staging environment. Developers use this branch as the basis of their development and where feature development should be branched from.</li>\n<li><strong>production</strong>: Contains the code that is deployed to production.</li>\n<li><strong>(<em>feature</em> branch)</strong>: Forked from <strong>master</strong> to work on a new feature/fix/etc by a single developer. They are designed to be short-lived and used for very granular changes. They should be merged/PR'ed quickly to keep code reviews narrow and focused. In other words, if a feature branch is open for more than a week, it's been open too long.</li>\n</ul>\n<h2>Workflow</h2>\n<p>To do work on a new feature or bug fix, this would be the workflow:</p>\n<ol>\n<li>\n<p>Developer creates a new <em>feature</em> branch from <strong>master</strong></p>\n<ul>\n<li>In <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/How%20to%20File%20Bugs%20Tasks%20and%20Questions.md#what-is-zenhub\">Zenhub</a>, the issue is moved from Ready to Current Sprint to In Progress.</li>\n</ul>\n</li>\n<li>Developer works on a new feature and commits code to <em>feature</em> branch</li>\n<li>Developer rebases their <em>feature</em> branch with the <strong>master</strong> branch</li>\n<li>\n<p>Developer submits a pull request from the <em>feature</em> branch to the <strong>master</strong> branch.</p>\n<ul>\n<li>There is a default <a href=\"https://github.com/department-of-veterans-affairs/vets-api/blob/master/.github/PULL_REQUEST_TEMPLATE.md\">Pull Request Template</a> in place for Vets-API.  Please use this as directed.</li>\n<li>The issue is moved from In Progress to Validate</li>\n</ul>\n</li>\n<li>\n<p>A peer developer code reviews the pull request (If not acceptable, the two developers discuss before moving on or ending here)</p>\n<ul>\n<li>See <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/Engineering/Code%20Review%20Norms.md\">Code Review Norms</a> for more information on how we do code reviews.</li>\n</ul>\n</li>\n<li>\n<p>If the pull request looks good, the peer reviewers approve the request</p>\n<ul>\n<li>These are product people or developers.</li>\n</ul>\n</li>\n<li>\n<p>Developer [squash] merges <em>feature</em> into <strong>master</strong></p>\n<ul>\n<li>The issue is moved from Validate to Done</li>\n<li><strong>Important:</strong> If the PR doesn't get approved by the product person assigned to it, don't merge it yet! Ping them and ask for a review if it's been sitting around for a while.</li>\n</ul>\n</li>\n<li>An [automated] deploy is performed from the <strong>master</strong> branch to the <strong>staging</strong> environment</li>\n<li>An [automated] release branch is created from the <strong>master</strong> branch at 3:00 PM Eastern every weekday, an accompanying PR to <strong>production</strong> is made for this branch.</li>\n<li>If there are no comments and CI succeeds on the release PR, an [automated] merge into <strong>production</strong> occurs at 3:30 PM Eastern.</li>\n<li>An [automated] deploy is performed from the <strong>production</strong> branch to the <strong>production</strong> environment.</li>\n</ol>\n<h2>Permissions</h2>\n<p>For folks to have permissions on repositories, folks should be added to a <a href=\"https://github.com/orgs/department-of-veterans-affairs/teams\">team via the <strong>department-of-veterans-affairs</strong> GitHub organization</a>. When someone needs access to a repository, please add the corresponding team to the GitHub repository rather than adding individual contributors (to ease the maintenance burden for onboarding/offboarding).</p>\n<p>The <strong>Digital Service @ VA</strong> team should be have admin rights over any repository, with contractors having <strong>write</strong> permissions to anything they are working on.</p>\n<h2>New Repo Setup</h2>\n<p>For new public repositories to be used to store code, create a new repository using these steps:</p>\n<ol>\n<li>From <a href=\"https://github.com/orgs/department-of-veterans-affairs/dashboard\">https://github.com/orgs/department-of-veterans-affairs/dashboard</a>, click the <strong>New Repository</strong> button</li>\n<li>Enter a [descriptive] name, description, relevant <code>.gitignore</code> file,  a <strong>Creative Commons Zero 1.0 Universal</strong> license, and initialize it with a README.</li>\n<li>Switch the repository to <strong>Public</strong></li>\n<li>From the <strong>Branch</strong> selection box, create a new branch called <code>production</code></li>\n<li>Go to the <strong>Settings</strong> tab</li>\n<li>Under the <strong>Options</strong> sub-tab</li>\n<li>Uncheck <strong>Wiki</strong></li>\n<li>Uncheck <strong>Allow merge commits</strong></li>\n<li>Under the <strong>Collaborators &#x26; teams</strong> sub-tab,</li>\n<li>Add the <strong>Digital Service @ VA</strong> team with <strong>Admin</strong> privileges</li>\n<li>Add any other teams that need access with <strong>Write</strong> privileges</li>\n<li>Under the <strong>Branches</strong> sub-tab</li>\n<li>\n<p>Add <strong>master</strong> as protected branch, with the following options</p>\n<ul>\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> Protect this branch</li>\n<li class=\"task-list-item\">\n<p><input type=\"checkbox\" checked disabled> Require status checks to pass before merging</p>\n<ul>\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> Include administrators</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> Require branches to be up to date before merging</li>\n</ul>\n</li>\n<li class=\"task-list-item\">\n<p><input type=\"checkbox\" checked disabled> Restrict who can push to this branch</p>\n<ul>\n<li>Organization and repository administrators</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Do the same for <strong>production</strong> as <strong>master</strong></li>\n<li>Go to the <strong>Issues</strong> tab, then <strong>Labels</strong></li>\n<li>Delete the labels there</li>\n<li>Add the status labels per <a href=\"https://github.com/department-of-veterans-affairs/vets.gov-team/blob/master/Work%20Practices/How%20to%20File%20Bugs%20Tasks%20and%20Questions.md#labels\">this document</a></li>\n<li>Add any labels relevant to your project</li>\n</ol>\n<p>If you are starting a new code project, you may also want to use a starter project based on the type of project:</p>\n<ul>\n<li>Frontend: <a href=\"https://github.com/department-of-veterans-affairs/roadrunner-react\">roadrunner-react</a></li>\n<li>Backend: <a href=\"https://github.com/department-of-veterans-affairs/roadrunner-rails\">roadrunner-rails</a></li>\n</ul>\n<h2>Don't Do</h2>\n<p>Things you <em>must</em> avoid adding to any repositories unencrypted:</p>\n<ul>\n<li>PHI/PII</li>\n<li>authentication credentials</li>\n</ul>\n<p>Things you <em>must</em> avoid adding to public repositories unencrypted:</p>\n<ul>\n<li>VA internal URLs</li>\n</ul>\n<h2>Public Contributions</h2>\n<p>Vets.gov has the policy of keeping its code open sourced on GitHub, but not its GitHub Issues. This was done primarily to make sure the team can communicate extremely openly and not open the risk to PHI/PII ending up in the public. However, it also protects our ability to keep code open sourced by minimizing our organizational risk (since GitHub Issues cannot be truly deleted, if something sensitive is posted), as VA OI&#x26;T often has heart burn with open source.</p>\n<p>It's also difficult to prioritize open source contributions against team sprint priorities. While contributions are welcome, we need to set the expectation that they may not be accepted if the contribution doesn't align with team priorities.</p>\n<p>The following <code>CONTRIBUTING.md</code> files can be added to new public repos:</p>\n<pre><code># Contributing to Vets.gov Projects\n\n## How to Contribute\n\nThere are many ways to contribute to this project:\n\n### Bugs\n\nIf you spot a bug in the source code or a mistake in the documentation, let us know! File a GitHub Issue for this project.\n\nWhen filing an issue, add the following:\n\n- Title: Sentence that summarizes the bug concisely\n- Comment:\n    - The environment you experienced the bug (browser, browser version, kind of account any extensions enabled)\n    - The exact steps you took that triggered the bug. Steps 1, 2, 3, etc.\n    - The expected outcome\n    - The actual outcome, including screen shot\n    - (Bonus Points:) Animated GIF or video of the bug occurring\n- Label: Apply the label `bug`\n\n### Code Submissions\n\nDue to team sprint prioritization, we are not always able to review community pull requests in a timely fashion. We ask that you file an issue so that we can work the fix into the work that our team is already doing. The best way to make sure that you don't waste your time is to file an Issue before beginning work on the code to verify if the team will have bandwidth to review and that it fits into a product prioritization (these are typically every 1 or 2 weeks).\n\n### What isn't open?\n\nWe track tasks separately from the publicly visible GitHub Issues in this repository to ensure that sensitive PHI/PII doesn't wind up in the wrong place. We strive to work in the open as much as possible, but the team has decided that doing this keeps folks safer and allows us to keep the code itself open to all.\n\nWith this said, please still file Issues for public contributions and reporting bugs. We still look here. :smile:\n\n## Contact\n\nIf you have a question or comment about this project, file a GitHub Issue with your question in the Title, any context in the Comment, and add the `question` Label. For general questions, tag or assign to the product owner **Stacey Langer** (GitHub Handle: **@staceylanger**). For design questions, tag or assign to the design lead,  **Emily Wright-Moore** (GitHub Handle: **@emilyville**). For technical questions, tag or assign to the engineering lead, **Alex Yale-Loehr** (GitHub Handle: **@ayaleloehr**).\n</code></pre>","fields":{"slug":"Work Practices/Using GitHub and Contributing Code"}}},"pageContext":{"id":"18a00a94-905a-53f4-ab4a-905cf28049ef","name":"Work Practices/Using GitHub and Contributing Code"}}