{"data":{"markdownRemark":{"html":"<h2>[This page is a work in progress, please disregard at this point in time]</h2>\n<p>Vets.gov product is large and encompasses many teams. These include policy, product management, and technology. This space aims to be a source of information for new and existing members of the project about common processes (e.g. how tos for confluence and JIRA) and guidelines for visual design, user research, software development, and information security. </p>\n<p>The contents of these pages are considered living documents. If you find mistakes, please fix them. If you have suggestions, please add a comment or contact the page's owner.These include policy, product management, and technology. </p>\n<p>User Driven Design Process\nMost product and software development for Vets.gov is defined by user-driven User Research, Design, and Testing.  While the teams work in slightly different ways, this section providers an overview of the research, design and testing all teams are expected to complete before diving into the product development process.</p>\n<p>Product Development Process\nMost product and software development for Vets.gov uses agile methodologies and DevOps. While teams work in slightly different ways, this section provides an overview of the process at a high-level. Learn how an idea or an aspect of a rule because a shipping product.</p>\n<p>Product Request Process\nAfter releasing product and software, the teams need a single way to track issue requests - new feature ideas as well as defects.  With this form Vets.gov stakeholders, Vets.gov Call Center and others can submit a request to add something new or ask that something not working be fixed.  Once you complete the form, email it to XX. The teams will then triage and if applicable place in priority order on their backlogs.</p>\n<p>Tools\nTo support our agile development, our team uses a number of tools. This section gives a brief overview of core tools, including XX</p>\n<p>Engineering Guidelines\nAs our team grows and includes more and more people, it's important that we maintain consistency in quality and processes related to the software we ship. This section describes the hard rules, additional guidelines, and long-term vision of our system.</p>\n<p>Release Process\nWe believe in zero-downtime deploys, feature flags, and deploying often. This section describes our release process and the steps necessary to ship a product.</p>\n<p>How-Tos\nPlease use this section to share any useful how-tos or guides that you find or help to develop.</p>\n<p>Shared Code\nDeveloping a set of shared tools to be used across QPP increases development time, cuts down on deployment time, and provides hardening to our code base.</p>","fields":{"slug":"Work Practices/Product_Team_Process"}}},"pageContext":{"id":"03408297-709d-5d6d-b91d-d20649e566ca","name":"Work Practices/Product_Team_Process"}}