{"data":{"markdownRemark":{"html":"<h1>Team Norms [DRAFT]</h1>\n<p><em>These suggested norms are based on a collaborative workshop between DSVA and Ad Hoc on Oct 17, 2018</em></p>\n<ol>\n<li>Constantly and openly communicate - be willing to hop on the phone if slack/email aren't being effective</li>\n<li>Engage in non-judgemental communication</li>\n<li>Communicate transparently early and often - sharing what we do and don't know is better than waiting for all the answers before sharing any info.</li>\n<li>Make sure all members of the team feel heard</li>\n<li>Use shared struggle to build communication and trust, not to foster fear and blame</li>\n<li>Don't be random - have clear sense of direction</li>\n<li>Be driven by single purpose</li>\n<li>Don't compete with one another</li>\n<li>Treat people as humans, not interchangeable assets</li>\n<li>Don't be immature / lack commitment</li>\n<li>Leave ego at the door</li>\n<li>Recognize and appreciate peoples' work, instead of trying to squeeze more out of them</li>\n<li>Remove the stigma of failure by creating a respectful blameless culture that encourages taking risk and getting small things out early</li>\n<li>Assume best intentions - especially important on remote teams</li>\n<li>Trust one another and ask questions freely</li>\n<li>Form a collective BS umbrella - one person shieding the team, but also shield/support each other</li>\n</ol>\n<hr>\n<p><strong>Team Re-Org</strong></p>\n<p>Conversation starters with Team Leads:</p>\n<p><strong>Platform</strong>\nTools Team: building, documenting and supporting existing tools and other teams\nEXP (Optimizing Veterans Experience) Team: Plain Language, QA, 508, Call Center</p>\n<h4>Suggest a methodology (e.g.Kanban/Scrum)</h4>\n<p>What are some of the considerations that should feed this decision?</p>\n<ul>\n<li>If team is focused on new project development where priorities don't change as much from day-to-day, consider Scrum. </li>\n<li>If your team’s priorities change more rapidly, or additional flexibility is needed to move work in and out of your production schedule, Kanban may be better. </li>\n</ul>\n<h4>Share the suggested cadence</h4>\n<p>In general we want to have daily standup. What are some ideas for doing this on larger teams so it's productive and not mind-numbing?</p>\n<h5>Scrum</h5>\n<p>There have been suggestions to go to 9-day sprints rather than 10, so the last day can be for reporting and planning. </p>\n<ul>\n<li>We will start sprints on Wednesdays, then do planning and Sprint Reviews on Tuesdays (9 day sprints)</li>\n<li>We host Sprint retros and record the feedback...somewhere</li>\n</ul>\n<h5>Kanban</h5>\n<ul>\n<li>Set up WIP limit (can be per person, per discipline, etc). This would just be a starting point that would get modified with team input. Consider using past sprint burndowns to gather insights </li>\n<li>ZH has Kanban reporting but not sure if it is helpful for trying to capture cycle time</li>\n</ul>\n<h4>Reporting Structure</h4>\n<p>This will differ for Scrum/Kanban but will still need to happen at regular intervals. What does DSVA currently expect and how often?</p>\n<ul>\n<li>Use estimates for internal planning purposes but not for reporting; for Scrum we should use broader sprint goals and forecasts</li>\n<li>reports would include a review of tasks planned/completed, blockers, number of defects found or fixed; keep it short and consider two audiences (the sprint team+lead and interested outsiders/CORs). </li>\n<li>For Kanban, a snapshot of the prioritized list then a report on what part of the list got done</li>\n</ul>\n<p>*Create reporting channel in slack or email to forward finshed reports for teams - 2 wk cadence</p>\n<p>*Product Health Reporting (how tools are performing against KPIs, trends, feedback)can be more public - monthly</p>\n<h4>Talk priorities</h4>\n<ul>\n<li>present any data info associated with the suggested objectives to help target some priorities if it isn't clear</li>\n<li>clarify product ownership</li>\n</ul>\n<h4>Team Name??</h4>\n<p>Think about whether you think we should keep it as is or come up with fun ones? Whatever it is, we need to set up labels accordingly so we can hit the ground running and stay organized. There will likely be a larger discussion on this to confirm to try and maintain some harmony.</p>\n<ul>\n<li>Platform - Identity, APIs, Insights, Infrastructure</li>\n<li>App Team 1</li>\n<li>App Team 2</li>\n<li>Website</li>\n</ul>\n<hr>\n<h4>Pre Kick-off</h4>\n<p>We'll use the period between now and the 26th to prepare for the shift, transfer knowledge, and wrap up existing work.</p>\n<ul>\n<li>setting KPIs</li>\n</ul>\n<h4>Team Kick-off</h4>\n<ul>\n<li>Intro all members (who are we)</li>\n<li>Review mission/purpose of the team (why are we here)</li>\n<li>Call out what's in the currently in the portfolio and what the priority will be</li>\n<li>Set the tone (what meetings to expect)</li>\n<li>Feedback about challenges</li>\n</ul>\n<h4>Other things to consider:</h4>\n<ul>\n<li>Setting up one-on-one with new team members</li>\n<li>separating large groups into smaller, more targeted ones</li>\n<li>Creating a team charter if you see the value</li>\n<li>Cross-team coordination about priorities to ensure we have the right resources for product support</li>\n</ul>\n<p>*Ben will scrub in to help out Apps Team 2 until we get the PM in place</p>\n<p>Teams will be doing kick-offs the last week of Nov.</p>\n<ul>\n<li>Nov 26 - official start date</li>\n<li>Nov 27 - Planning</li>\n<li>Nov 28 - Start Sprint</li>\n</ul>\n<p>Dec 4 - Outcome Metrics For Success</p>","fields":{"slug":"Work Practices/Team Norms"}}},"pageContext":{"id":"8d29caba-3fb1-51cb-81bb-3565d1f17ffc","name":"Work Practices/Team Norms"}}